# 4.6 IC Combining & Exporting Data

# The script contains following points:

# 1. Import the dataset as a new dataframe

# 2. Check the dimensions of the imported dataframe

# 3. Merge the new dataframe with the df_ords dataframe

# 4. Export the merged dataframe in pkl format

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

# 1. Import the dataset as a new dataframe

In [2]:
# Create path variable

path= r'C:\Users\babum\Desktop\CF_Data Analytics\Data Immersion\Achievement 4\02-2023 Instacart Basket Analysis'

In [3]:
#Import dataset as a new dataframe

df_ords_prior = pd.read_csv(os.path.join(path,'02 Data','Original Data','order_products_prior.csv'), index_col = False)

In [4]:
# Import orders dataframe from prepared data

df_ords = pd.read_csv(os.path.join(path,'02 Data','Prepared Data', 'orders_checked.csv'),index_col = [0])

# 2. Check the dimensions of the imported dataframe

In [5]:
#Check the output for df_ords_prior

df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [6]:
#Check the output for df_ords

df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_status
0,2539329,1,1,2,8,NaN,new
1,2398795,1,2,3,7,15.0,existing
2,473747,1,3,3,12,21.0,existing
3,2254736,1,4,4,7,29.0,existing
4,431534,1,5,4,15,28.0,existing

In [7]:
df_ords_prior.shape

(32434489, 4)

In [8]:
df_ords.shape

(3421083, 7)

# 3. Merge the new dataframe with df_ords dataframe

In [9]:
# Merging the two dataframes with indicator

df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [10]:
# Check the output

df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_status,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,new,196,1,0,both
1,2539329,1,1,2,8,NaN,new,14084,2,0,both
2,2539329,1,1,2,8,NaN,new,12427,3,0,both
3,2539329,1,1,2,8,NaN,new,26088,4,0,both
4,2539329,1,1,2,8,NaN,new,26405,5,0,both

In [11]:
# Check the frequency of the new flagged column

df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

# 4.Export merged dataframe in pkl format

In [12]:
# Export data to pkl

df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))